Revit 2027 API
DocumentChangedEventArgs Properties
The DocumentChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Operation |  The operation associated with this event
Top
See Also
Reference
DocumentChangedEventArgs Class
Autodesk.Revit.DB.Events Namespace